view/fuel-guru/load test/test1.yml
config:
  target: import.meta.env.VITE_HEROKULINK + '/gasstations/search'
    phases:
    - duration: 10 # number of seconds for the scenario to run in
      arrivalRate: 100 # number of virtual users
scenarios:
  - flow:
      - get: 
          url: "/"
  - flow:
      - post: 
          url: "/login"
          json:
              email: "you@example.com"
              password: "Password"
  - flow:
      - post: 
          url: "/deposit"
          json:
              money: 100